Courses/7370/Lectures/CSP/index.org

# -*- mode: org -*-
#+date: 2019-12-06
#+TITLE: Hoare's CSP
#+AUTHOR: Prabhaker Mateti
#+HTML_LINK_HOME: ../../Top/index.html
#+HTML_LINK_UP: ../
#+HTML_HEAD: <style> P,li {text-align: justify} code {color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "<a href=\"../../\"> ../../</a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2018 <a href=\"http://www.wright.edu/~pmateti\">www.wright.edu/~pmateti</a> &bull; %d"))
#+STARTUP:showeverything
#+OPTIONS: toc:2

This page contains a few examples of distributed computing done in CSP.
Our focus is not on time or space complexity, but on the more
qualitative issues. Some of the "solutions" may not be correct, and,
when they are, can easily be improved. A few times I chose to 'describe'
in English rather than write pseudo-code in order to explain the ideas.
I am sure you can all fill-in the details and code it in CSP. Not all
solutions are complete.

TBD Typography: The fat-bar is shown as either '|' or '[]'. The parallel
bar is shown as '//'. CSP loop is shown either as =*[ ... ]= or as
=do ... od=. CSP guarded if is shown either as = if ... fi= or as
= [ ... ]=. I will make it consistent one of these days ;-)

--------------

* Qualities in Distributed Programs

We wish to (a) maximize concurrency, (b) we prefer a symmetric solution,
(c) we rate correctness much higher than efficiency, and (d) cannot
tolerate deadlocks or (e) livelocks.  Defend /why/ for each of these
five.

Of course, we do not mean "maximize" in the pure mathematical sense it
is used in algorithm analyis.

* Modeling "Real" Devices

We are faced with the problem of controlling the two-way traffic on an
old bridge. The bridge is so old and weak that it can only hold at most
10 cars at a time. Trucks and other heavy vehicles are forbidden.
Traffic lights, and sensors that detect the passing of cars are
installed on both ends of the bridge. Present all the processes in CSP.
State clearly any other assumptions that you found necessary for your
solution.

| ---------------------------------------------\\   |      | In our visualization, the bridge is drawn horizontally with the top lane with traffic going from right-to-left, and the bottom lane with traffic going from left-to-right. There is an entry sensor (s2, s3) and an exit sensor (s1, s4) installed in each lane that detects cars passing over. TL1 and TL2 are traffic lights.   |
| s1 <-- right-to-left <--- s2 TL1\\                |      |                                                                                                                                                                                                                                                                                                                                   |
| ---------------------------------------------\\   |      |                                                                                                                                                                                                                                                                                                                                   |
| TL2 s3 --> left-to-right ---> s4\\                |      |                                                                                                                                                                                                                                                                                                                                   |
| ---------------------------------------------\\   |      |                                                                                                                                                                                                                                                                                                                                   |

We cannot present *all* the processes -- such as the cars. In a problem
such as this, the "environment" is a collection of processes that our
CSP processes interact with.

E.g., the following models the physical traffic light for us as an
output device.

#+BEGIN_EXAMPLE
    trafficLight::
      int bulbColor := red;
      do controller ? bulbColor --> skip od
#+END_EXAMPLE

Here is a model of the mouse for us as an input device.

#+BEGIN_EXAMPLE
    Mouse::
      int x := 0, y := 0;
      do human ? click(buttonNumber) --> clientProcess ! buttonNumber 
      [] human ? motion(dx, dy) --> x += dx; y += dy; clientProcess ! (x, y)
      od
#+END_EXAMPLE

We cannot describe the human process -- obviously! In our CSP examples,
we would model the mouse far more abstractly. See, e.g., the Mine
Sweeper.

#+BEGIN_EXAMPLE
    sensor(i: 1 .. 4) ::
      int count := 0;
      do car ? passesOver -->
         count ++;
         controller ! count
      od
#+END_EXAMPLE

The problem above is asking you to write the code for controller.

* Remove the Least Member in SSI

Solve the exercise in Section 4.6 of Hoare's CSP paper. That is, provide
a least() "remove the least member" operation in the small set of
integers process-collection.

We just need to introduce a boolean to represent empty-handed or not.
And, fix the new case below properly.

#+BEGIN_EXAMPLE
    S(i: 1..100) ::
      empty := true;
      do empty -->
        if S(i-1)?has(n) --> S(0)!false
        [] S(i-1)?insert(n) --> empty := false
        [] S(i-1)?least() --> S(i-1)!noneleft()
        fi
      [] not empty -->
        if S(i-1)?has(m) --> ... as before ...
        [] S(i-1)?insert(m) --> ... as before ...
        [] S(i-1)?least() --> ...new code ...
            fi
      od
#+END_EXAMPLE

* n-th Minimum

We have a CSP process /C/ that outputs an unending stream of
non-negative numbers to a process named, say, /X/. We want /X/ to be
able to receive requests of the form /X!nthmin(n)/ from a user process
/U/ and respond with /U!x/, where $x$ is the $n$-th smallest number it
has seen so far from /C/. If /X/ has seen fewer than $n$ numbers so far,
or if $n$ is greater than 10, or less than 1, the value of $x$ to use is
-1. Write the process /X/ in CSP. Maximize concurrency. Process /C/ must
not suffer delays.

#+BEGIN_EXAMPLE
    S(i: 1..10) ::
      do S(0)?out() --> U!-1
      [] S(i-1)?x -->
         do S(0)?out() --> U!x
         [] S(i-1)?y -->
             if  x = y --> skip
             []x < y --> S(i+1)!y
             []x > y --> S(i+1)!x; x := y
             fi
         od
      od

    S(0) ::
      do C ? n --> S(1)!n
      [] U ? nthmin(n) -->
          if 1 > n or  n > 10 --> U !-1
          [] 0 < n and n < 11 --> S(n) ! out()
          fi
      od

    S(11) ::  do S(10)?x --> skip od
    X :: S(i: 0..11)
#+END_EXAMPLE

