Courses/7370/Lectures/CSP/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-10 Tue 08:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hoare's CSP</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Hoare's CSP</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org004f684">1. Qualities in Distributed Programs</a></li>
<li><a href="#org62cdfc8">2. Modeling "Real" Devices</a></li>
<li><a href="#org3f0775c">3. Remove the Least Member in SSI</a></li>
<li><a href="#org0903ca7">4. n-th Minimum</a></li>
<li><a href="#org605da72">5. Exchange Evens With Odds</a></li>
<li><a href="#orgae64723">6. Mine Sweeper in CSP</a></li>
<li><a href="#orgc3d9807">7. Elevator Simulation</a></li>
<li><a href="#org056398d">8. Exercises</a></li>
<li><a href="#org69a02fc">9. References</a></li>
<li><a href="#org71807b7">10. End</a></li>
</ul>
</div>
</div>
<p>
This page contains a few examples of distributed computing done in CSP.
Our focus is not on time or space complexity, but on the more
qualitative issues. Some of the "solutions" may not be correct, and,
when they are, can easily be improved. A few times I chose to 'describe'
in English rather than write pseudo-code in order to explain the ideas.
I am sure you can all fill-in the details and code it in CSP. Not all
solutions are complete.
</p>

<p>
TBD Typography: The fat-bar is shown as either '|' or '[]'. The parallel
bar is shown as '//'. CSP loop is shown either as <code>*[ ... ]</code> or as
<code>do ... od</code>. CSP guarded if is shown either as = if &#x2026; fi= or as
= [ &#x2026; ]=. I will make it consistent one of these days ;-)
</p>

<hr />

<div id="outline-container-org004f684" class="outline-2">
<h2 id="org004f684"><span class="section-number-2">1</span> Qualities in Distributed Programs</h2>
<div class="outline-text-2" id="text-1">
<p>
We wish to (a) maximize concurrency, (b) we prefer a symmetric solution,
(c) we rate correctness much higher than efficiency, and (d) cannot
tolerate deadlocks or (e) livelocks.  Defend <i>why</i> for each of these
five.
</p>

<p>
Of course, we do not mean "maximize" in the pure mathematical sense it
is used in algorithm analyis.
</p>
</div>
</div>

<div id="outline-container-org62cdfc8" class="outline-2">
<h2 id="org62cdfc8"><span class="section-number-2">2</span> Modeling "Real" Devices</h2>
<div class="outline-text-2" id="text-2">
<p>
We are faced with the problem of controlling the two-way traffic on an
old bridge. The bridge is so old and weak that it can only hold at most
10 cars at a time. Trucks and other heavy vehicles are forbidden.
Traffic lights, and sensors that detect the passing of cars are
installed on both ends of the bridge. Present all the processes in CSP.
State clearly any other assumptions that you found necessary for your
solution.
</p>

<p>
 In our visualization, the bridge is drawn horizontally with the top lane with traffic going from right-to-left, and the bottom lane with traffic going from left-to-right. There is an entry sensor (s2, s3) and an exit sensor (s1, s4) installed in each lane that detects cars passing over. TL1 and TL2 are traffic lights.</td>

<p>
We cannot present <b>all</b> the processes &#x2013; such as the cars. In a problem
such as this, the "environment" is a collection of processes that our
CSP processes interact with.
</p>

<p>
E.g., the following models the physical traffic light for us as an
output device.
</p>

<pre class="example">
trafficLight::
  int bulbColor := red;
  do controller ? bulbColor --&gt; skip od
</pre>

<p>
Here is a model of the mouse for us as an input device.
</p>

<pre class="example">
Mouse::
  int x := 0, y := 0;
  do human ? click(buttonNumber) --&gt; clientProcess ! buttonNumber 
  [] human ? motion(dx, dy) --&gt; x += dx; y += dy; clientProcess ! (x, y)
  od
</pre>

<p>
We cannot describe the human process &#x2013; obviously! In our CSP examples,
we would model the mouse far more abstractly. See, e.g., the Mine
Sweeper.
</p>

<pre class="example">
sensor(i: 1 .. 4) ::
  int count := 0;
  do car ? passesOver --&gt;
     count ++;
     controller ! count
  od
</pre>

<p>
The problem above is asking you to write the code for controller.
</p>
</div>
</div>

<div id="outline-container-org3f0775c" class="outline-2">
<h2 id="org3f0775c"><span class="section-number-2">3</span> Remove the Least Member in SSI</h2>
<div class="outline-text-2" id="text-3">
<p>
Solve the exercise in Section 4.6 of Hoare's CSP paper. That is, provide
a least() "remove the least member" operation in the small set of
integers process-collection.
</p>

<p>
We just need to introduce a boolean to represent empty-handed or not.
And, fix the new case below properly.
</p>

<pre class="example">
S(i: 1..100) ::
  empty := true;
  do empty --&gt;
    if S(i-1)?has(n) --&gt; S(0)!false
    [] S(i-1)?insert(n) --&gt; empty := false
    [] S(i-1)?least() --&gt; S(i-1)!noneleft()
    fi
  [] not empty --&gt;
    if S(i-1)?has(m) --&gt; ... as before ...
    [] S(i-1)?insert(m) --&gt; ... as before ...
    [] S(i-1)?least() --&gt; ...new code ...
        fi
  od
</pre>
</div>
</div>

<div id="outline-container-org0903ca7" class="outline-2">
<h2 id="org0903ca7"><span class="section-number-2">4</span> n-th Minimum</h2>
<div class="outline-text-2" id="text-4">
<p>
We have a CSP process <i>C</i> that outputs an unending stream of
non-negative numbers to a process named, say, <i>X</i>. We want <i>X</i> to be
able to receive requests of the form <i>X!nthmin(n)</i> from a user process
<i>U</i> and respond with <i>U!x</i>, where \(x\) is the $n$-th smallest number it
has seen so far from <i>C</i>. If <i>X</i> has seen fewer than \(n\) numbers so far,
or if \(n\) is greater than 10, or less than 1, the value of \(x\) to use is
-1. Write the process <i>X</i> in CSP. Maximize concurrency. Process <i>C</i> must
not suffer delays.
</p>

<pre class="example">
S(i: 1..10) ::
  do S(0)?out() --&gt; U!-1
  [] S(i-1)?x --&gt;
     do S(0)?out() --&gt; U!x
     [] S(i-1)?y --&gt;
         if  x = y --&gt; skip
         []x &lt; y --&gt; S(i+1)!y
         []x &gt; y --&gt; S(i+1)!x; x := y
         fi
     od
  od

S(0) ::
  do C ? n --&gt; S(1)!n
  [] U ? nthmin(n) --&gt;
      if 1 &gt; n or  n &gt; 10 --&gt; U !-1
      [] 0 &lt; n and n &lt; 11 --&gt; S(n) ! out()
      fi
  od

S(11) ::  do S(10)?x --&gt; skip od
X :: S(i: 0..11)
</pre>
</div>
</div>
