Courses/7370/Lectures/CSP/index.org
* Exchange Evens With Odds

There are three CSP processes $A$, $B$ and $C$ each with a local array
of size $n$ of integers. Among these $3*n$ numbers, there are at least
$n$ even numbers, and at least $n$ odd numbers. Write an algorithm in
CSP so that the processes send each other integers, one at a time,
eventually terminating with process $A$ having in its array only even
numbers, process $C$ having in its array only odd numbers. Process B may
end up with the rest of even/odd numbers. You must make sure no number
originally present is lost.

#+BEGIN_EXAMPLE
    EO ::
        e := 0;     /* a[1..e] are even */
        d := n+1;   /* a[d..n] are odd  */
        do e+1 < d   & even a[e+1] --> e := e + 1
        [] e+1 < d   & odd  a[d-1] --> d := d - 1
        [] e+1 < d-1 & odd  a[e+1] & even a[d-1] -->
            d := d - 1; e := e + 1;
            swap a[d] with a[e]
        od

    A ::    EO; do e < n --> e := e + 1; B!a[e]; B?a[e] od
    C ::    EO; do d > 1 --> d := d - 1; B!a[d]; B?a[d] od
    B ::    EO;
        do e > 0;   A?x --> A!a[e]; e := e-1; d := d-1; a[d] := x 
        [] d < n+1; C?x --> C!a[d]; e := e+1; d := d+1; a[e] := x
        od
#+END_EXAMPLE

How does the following differ from above? Is it correct? Is it better?

#+BEGIN_EXAMPLE
    A ::    i := 1;
        do i < n+1 -->
            if even a[i] --> skip
            [] odd  a[i] --> B!a[i]; B?a[i]
            fi;
            i := i + 1
        od

    C ::    i := 1;
        do i < n+1 ->
            if odd  a[i] --> skip
            [] even a[i] --> B!a[i]; B?a[i]
            fi;
            i := i + 1
        od

    B ::    e := 0;     /* a[1..e] are even */
        d := n+1;   /* a[d..n] are odd */
        do e+1 < d   & even a[e+1] --> e := e + 1
        [] e+1 < d   & odd  a[d-1] --> d := d - 1
        [] e+1 < d-1 & odd  a[e+1] & even a[d-1] -->
            d := d - 1; e := e + 1;
            swap a[d] with a[e]
        [] e > 0;   A?x --> A!a[e]; a[e] := x; e := e - 1
        [] d < n+1; C?x --> C!a[d]; a[d] := x; d := d + 1
        od
#+END_EXAMPLE

* Mine Sweeper in CSP

This is a CSP rendering of the well known game. Quite incomplete. The
modeling of smiley, the mine counter and the timer are left to you as a
further exercise.

#+BEGIN_EXAMPLE
    mymine := 0, or 1 
    /* number of mines in this cell */
    /* 0 or 1 -- no other values are possible */

    cell := blank;
    /* what is "shown on the cell", enumerated type */
    /* uncovered: 0,1..8, the number of mines that neighbors have */
    /* uncovered: boom = 9 = game over = tripped a mine */
    /* uncovered: exposed = 10, exposed mine after tripping */
    /* uncovered: incorrect = 11 */
    /* covered: red-flag = 12, ? = qmark = 13, blank = 14 */

    /* left, middle, right are mouse button clicks */
#+END_EXAMPLE

#+BEGIN_EXAMPLE
    do P(a, b)?howmany -> P(a, b)!mine
    [] P(a, b)?uncover -> UNCOVER
    [] P(a, b)?show-mine -> SHOW-MINE
    [] mouse?left -> UNCOVER
    [] mouse?middle -> MID
    [] mouse?right -> RIG
    od
#+END_EXAMPLE

* Elevator Simulation

This simulation is often used in courses that teach the use of
processes. There are T floors, and N elevators. Add whatever missing
detail.

We may need to maintain the following info. Distribute it among our
processes.

| evat[e]      | elevator e is at floor i = at[e]; turn the i-th light for e on          |
|              | and the other light that was on now goes off.                           |
| dir[e]       | the travel direction --stopped, going-up, going-down -- of elevator e   |
| req[i]       | requests made at floor i: clear =00, goUp =01, goDn =10, both =11       |
| stop[e][i]   | elev e must stop on floor i, true/false                                 |
| bot[e]       | lowest floor to go to                                                   |
| top[e]       | highest floor to go to                                                  |
| [.]          | means for all indices                                                   |

Elevator model, bare minimum. Elevator motor is powered on unless dir =
stopped, and is moving in that direction. Add an internal display panel.

#+BEGIN_EXAMPLE
    elevator(e: 1 .. N) ::
      int dir := stopped, d, f :=  1;
      do humanInTheElevator ? presses(f) --> controller! button(f)
      [] sensor ? detects(f) --> controller! at(f)
      [] controller? motor(d) --> dir := d
      [] controller? doorsOpen() --> skip
      [] controller? doorsClose() --> skip
      od
#+END_EXAMPLE

#+BEGIN_EXAMPLE
    floor(f: 1 .. T)::
      buttons := clear;
      do  humanOnTheFloor ? button(goBits) --> controller! button(goBits)
      []  controller ? buttons -> skip
      od
#+END_EXAMPLE

We are to write the code for Controller. Describe as precisely
(mathematically?) as you can what the functionality of the controller
ought to be.

#+BEGIN_EXAMPLE
    controller ::
    int goBits
    stop[.][.] := false; req[.]:= clear;
    at[.] := 1; dir[.] := stopped; bot[.] := ...; top[.] := ...; 

    do floor(f) ? button(goBits) --> req[f] := req[f] | goBits; floor(f)! req(f)
    [] elevator(e)? button(f) --> stop[e][f] := true
    [] elevator(e)? at(f) -->
        evat[e] := f
        ... should we stop the elevator, open doors, ...
    od
#+END_EXAMPLE

