Courses/7370/Lectures/CSP/index.html

<div id="outline-container-org605da72" class="outline-2">
<h2 id="org605da72"><span class="section-number-2">5</span> Exchange Evens With Odds</h2>
<div class="outline-text-2" id="text-5">
<p>
There are three CSP processes \(A\), \(B\) and \(C\) each with a local array
of size \(n\) of integers. Among these \(3*n\) numbers, there are at least
\(n\) even numbers, and at least \(n\) odd numbers. Write an algorithm in
CSP so that the processes send each other integers, one at a time,
eventually terminating with process \(A\) having in its array only even
numbers, process \(C\) having in its array only odd numbers. Process B may
end up with the rest of even/odd numbers. You must make sure no number
originally present is lost.
</p>

<pre class="example">
EO ::
    e := 0;     /* a[1..e] are even */
    d := n+1;   /* a[d..n] are odd  */
    do e+1 &lt; d   &amp; even a[e+1] --&gt; e := e + 1
    [] e+1 &lt; d   &amp; odd  a[d-1] --&gt; d := d - 1
    [] e+1 &lt; d-1 &amp; odd  a[e+1] &amp; even a[d-1] --&gt;
        d := d - 1; e := e + 1;
        swap a[d] with a[e]
    od

A ::    EO; do e &lt; n --&gt; e := e + 1; B!a[e]; B?a[e] od
C ::    EO; do d &gt; 1 --&gt; d := d - 1; B!a[d]; B?a[d] od
B ::    EO;
    do e &gt; 0;   A?x --&gt; A!a[e]; e := e-1; d := d-1; a[d] := x 
    [] d &lt; n+1; C?x --&gt; C!a[d]; e := e+1; d := d+1; a[e] := x
    od
</pre>

<p>
How does the following differ from above? Is it correct? Is it better?
</p>

<pre class="example">
A ::    i := 1;
    do i &lt; n+1 --&gt;
        if even a[i] --&gt; skip
        [] odd  a[i] --&gt; B!a[i]; B?a[i]
        fi;
        i := i + 1
    od

C ::    i := 1;
    do i &lt; n+1 -&gt;
        if odd  a[i] --&gt; skip
        [] even a[i] --&gt; B!a[i]; B?a[i]
        fi;
        i := i + 1
    od

B ::    e := 0;     /* a[1..e] are even */
    d := n+1;   /* a[d..n] are odd */
    do e+1 &lt; d   &amp; even a[e+1] --&gt; e := e + 1
    [] e+1 &lt; d   &amp; odd  a[d-1] --&gt; d := d - 1
    [] e+1 &lt; d-1 &amp; odd  a[e+1] &amp; even a[d-1] --&gt;
        d := d - 1; e := e + 1;
        swap a[d] with a[e]
    [] e &gt; 0;   A?x --&gt; A!a[e]; a[e] := x; e := e - 1
    [] d &lt; n+1; C?x --&gt; C!a[d]; a[d] := x; d := d + 1
    od
</pre>
</div>
</div>

<div id="outline-container-orgae64723" class="outline-2">
<h2 id="orgae64723"><span class="section-number-2">6</span> Mine Sweeper in CSP</h2>
<div class="outline-text-2" id="text-6">
<p>
This is a CSP rendering of the well known game. Quite incomplete. The
modeling of smiley, the mine counter and the timer are left to you as a
further exercise.
</p>

<pre class="example">
mymine := 0, or 1 
/* number of mines in this cell */
/* 0 or 1 -- no other values are possible */

cell := blank;
/* what is "shown on the cell", enumerated type */
/* uncovered: 0,1..8, the number of mines that neighbors have */
/* uncovered: boom = 9 = game over = tripped a mine */
/* uncovered: exposed = 10, exposed mine after tripping */
/* uncovered: incorrect = 11 */
/* covered: red-flag = 12, ? = qmark = 13, blank = 14 */

/* left, middle, right are mouse button clicks */
</pre>

<pre class="example">
do P(a, b)?howmany -&gt; P(a, b)!mine
[] P(a, b)?uncover -&gt; UNCOVER
[] P(a, b)?show-mine -&gt; SHOW-MINE
[] mouse?left -&gt; UNCOVER
[] mouse?middle -&gt; MID
[] mouse?right -&gt; RIG
od
</pre>
</div>
</div>

<div id="outline-container-orgc3d9807" class="outline-2">
<h2 id="orgc3d9807"><span class="section-number-2">7</span> Elevator Simulation</h2>
<div class="outline-text-2" id="text-7">
<p>
This simulation is often used in courses that teach the use of
processes. There are T floors, and N elevators. Add whatever missing
detail.
</p>

<p>
We may need to maintain the following info. Distribute it among our
processes.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">evat[e]</td>
<td class="org-left">elevator e is at floor i = at[e]; turn the i-th light for e on</td>
</tr>

<tr>
<td class="org-left"> </td>
<td class="org-left">and the other light that was on now goes off.</td>
</tr>

<tr>
<td class="org-left">dir[e]</td>
<td class="org-left">the travel direction &#x2013;stopped, going-up, going-down &#x2013; of elevator e</td>
</tr>

<tr>
<td class="org-left">req[i]</td>
<td class="org-left">requests made at floor i: clear =00, goUp =01, goDn =10, both =11</td>
</tr>

<tr>
<td class="org-left">stop[e][i]</td>
<td class="org-left">elev e must stop on floor i, true/false</td>
</tr>

<tr>
<td class="org-left">bot[e]</td>
<td class="org-left">lowest floor to go to</td>
</tr>

<tr>
<td class="org-left">top[e]</td>
<td class="org-left">highest floor to go to</td>
</tr>

<tr>
<td class="org-left">[.]</td>
<td class="org-left">means for all indices</td>
</tr>
</tbody>
</table>

<p>
Elevator model, bare minimum. Elevator motor is powered on unless dir =
stopped, and is moving in that direction. Add an internal display panel.
</p>

<pre class="example">
elevator(e: 1 .. N) ::
  int dir := stopped, d, f :=  1;
  do humanInTheElevator ? presses(f) --&gt; controller! button(f)
  [] sensor ? detects(f) --&gt; controller! at(f)
  [] controller? motor(d) --&gt; dir := d
  [] controller? doorsOpen() --&gt; skip
  [] controller? doorsClose() --&gt; skip
  od
</pre>

<pre class="example">
floor(f: 1 .. T)::
  buttons := clear;
  do  humanOnTheFloor ? button(goBits) --&gt; controller! button(goBits)
  []  controller ? buttons -&gt; skip
  od
</pre>

<p>
We are to write the code for Controller. Describe as precisely
(mathematically?) as you can what the functionality of the controller
ought to be.
</p>

<pre class="example">
controller ::
int goBits
stop[.][.] := false; req[.]:= clear;
at[.] := 1; dir[.] := stopped; bot[.] := ...; top[.] := ...; 

do floor(f) ? button(goBits) --&gt; req[f] := req[f] | goBits; floor(f)! req(f)
[] elevator(e)? button(f) --&gt; stop[e][f] := true
[] elevator(e)? at(f) --&gt;
    evat[e] := f
    ... should we stop the elevator, open doors, ...
od
</pre>
</div>
</div>
