Courses/7370/Lectures/CSP/index.org
* Exercises

1. Process A has a set S of m integers and B has a set T of n integers.
   The two processes are to exchange values one at a time until all
   elements of S are less than all elements of T. Assume that all the
   m+n integers are distinct.
2. The solution given for /Recursive Data Representation: Small Set of
   Integers/ of Hoare's CSP paper is reproduced below.

   #+BEGIN_EXAMPLE
          S(i: 1 .. 100) ::
           do   n: integer; S(i-1)?has(n) --> S(0)!false
           []   n: integer; S(i-1)?insert(n) -->  
               do m:   integer; S(i-1)?has(m) -->  
                   if   m <=  n --> S(0)!(m = n)
                   []  m >   n --> S(i+1)!has(m)
                   fi 
                   [] m: integer; S(i-1)?insert(m) -->  
                   if  m < n --> S(i+1)!insert(n); n := m
                   [] m = n --> skip
                   [] m > n --> S(i+1)!insert(m)
                               fi
           od  od 
   #+END_EXAMPLE

   1. Write convincing argument that the algorithms for has and insert
      are correct.
   2. Write a loop invariant for the inner loop.
   3. Extend the solution to respond to a command =S(1)!remove(x)= from
      S(0) that removes x from the set, if it contains it, and does
      nothing if it does not.
   4. Extend the solution to respond to a command =removeMin()= that
      removes the least member of the set, if non-empty, and does
      nothing if the set is empty. Explain your solution. Annotate your
      algorithm.
   5. Extend it to respond to a request =S(1)!count()= from S(0) that
      expects a reply with the number of elements in the set.

3. Is the CSP code = [X!2 // Y!3]= equivalent to
   = if    true --> X!2; Y!3   [] true --> Y!3; X!2 ]= ?
4. Windows made the game of Mine Sweepers popular. Imagine each cell is
   populated with CSP processes. Describe further details.
5. Given a large (in the zillions) bag B of integers, find the third
   largest number in B. Assume that B has at least three distinct
   integers. Two solutions, one in CSP and another in C-Linda are to be
   developed. It is not required that both use the same "idea." Present
   your solutions with full explanations. For CSP, the bag is generated
   by process B whose structure is =B :: do ... --> P!n od=. Develop the
   process P and appropriately chosen other processes.
6. You are given a large (in the zillions) bag B of triplets of unsigned
   integers (x, y, d). Each triplet represents a horizontal line segment
   of length d in the Euclidean plane whose left end point is at (x, y).
   A (x1, y1, d1) /contains/ (x2, y2, d2) if y1 == y2 and x1 <= x2 and
   x1 + d1 >= x2 + d2. We wish to minimize the size (== number of
   triplets) of the given bag of triplets so that every original triplet
   is contained in some triplet in the resulting collection. Fully
   explain your solution design (10 points) in English for CSP.
   Implement (10 points) the design in CSP. The bag is generated by
   process Q whose structure is =Q :: do ... --> P!(x, y, d)]=. Develop
   the process P and any others.

* References

1. C. A. R. Hoare, ``Communicating Sequential Processes,''
   /Communications of the ACM/, 1978, Vol. 21, No. 8, 666-677. This
   paper has many exercises for you to do.
2. Andrews, Chapter 8 on Synchronous Message Passing, and also Section
   10.2 on Occam.
3. U of Kent, Communicating Sequential Processes for Java (JCSP),
   [[http://www.cs.kent.ac.uk/projects/ofa/jcsp/]]

1. http://www.cs.ox.ac.uk/ucs/ Bill Roscoe's book Understanding
   Concurrent Systems.  2010, ISBN 978-1-84882-257-3.

* End
# Local variables:
# after-save-hook: org-html-export-to-html
# end:
