Courses/7370/Lectures/CSP/index.html

<div id="outline-container-org056398d" class="outline-2">
<h2 id="org056398d"><span class="section-number-2">8</span> Exercises</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>Process A has a set S of m integers and B has a set T of n integers.
The two processes are to exchange values one at a time until all
elements of S are less than all elements of T. Assume that all the
m+n integers are distinct.</li>
<li><p>
The solution given for <i>Recursive Data Representation: Small Set of
Integers</i> of Hoare's CSP paper is reproduced below.
</p>

<pre class="example">
S(i: 1 .. 100) ::
 do   n: integer; S(i-1)?has(n) --&gt; S(0)!false
 []   n: integer; S(i-1)?insert(n) --&gt;  
     do m:   integer; S(i-1)?has(m) --&gt;  
         if   m &lt;=  n --&gt; S(0)!(m = n)
         []  m &gt;   n --&gt; S(i+1)!has(m)
         fi 
     [] m: integer; S(i-1)?insert(m) --&gt;  
         if  m &lt; n --&gt; S(i+1)!insert(n); n := m
         [] m = n --&gt; skip
         [] m &gt; n --&gt; S(i+1)!insert(m)
         fi
 od  od 
</pre>

<ol class="org-ol">
<li>Write convincing argument that the algorithms for has and insert
are correct.</li>
<li>Write a loop invariant for the inner loop.</li>
<li>Extend the solution to respond to a command <code>S(1)!remove(x)</code> from
S(0) that removes x from the set, if it contains it, and does
nothing if it does not.</li>
<li>Extend the solution to respond to a command <code>removeMin()</code> that
removes the least member of the set, if non-empty, and does
nothing if the set is empty. Explain your solution. Annotate your
algorithm.</li>
<li>Extend it to respond to a request <code>S(1)!count()</code> from S(0) that
expects a reply with the number of elements in the set.</li>
</ol></li>

 <li>Is the CSP code <code> [X!2 // Y!3]</code> equivalent to
  <code> if    true &#x2013;&gt; X!2; Y!3   [] true &#x2013;&gt; Y!3; X!2 ]</code> ?</li>
<li>Windows made the game of Mine Sweepers popular. Imagine each cell is
populated with CSP processes. Describe further details.</li>
<li>Given a large (in the zillions) bag B of integers, find the third
largest number in B. Assume that B has at least three distinct
integers. Two solutions, one in CSP and another in C-Linda are to be
developed. It is not required that both use the same "idea." Present
your solutions with full explanations. For CSP, the bag is generated
by process B whose structure is <code>B :: do ... --&gt; P!n od</code>. Develop the
process P and appropriately chosen other processes.</li>
<li>You are given a large (in the zillions) bag B of triplets of unsigned
integers (x, y, d). Each triplet represents a horizontal line segment
of length d in the Euclidean plane whose left end point is at (x, y).
A (x1, y1, d1) <i>contains</i> (x2, y2, d2) if y1 <code>= y2 and x1 &lt;</code> x2 and
x1 + d1 &gt;= x2 + d2. We wish to minimize the size (== number of
triplets) of the given bag of triplets so that every original triplet
is contained in some triplet in the resulting collection. Fully
explain your solution design (10 points) in English for CSP.
Implement (10 points) the design in CSP. The bag is generated by
process Q whose structure is <code>Q :: do ... --&gt; P!(x, y, d)]</code>. Develop
the process P and any others.</li>
</ol>
</div>
</div>

<div id="outline-container-org69a02fc" class="outline-2">
<h2 id="org69a02fc"><span class="section-number-2">9</span> References</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>C. A. R. Hoare, ``Communicating Sequential Processes,''
<i>Communications of the ACM</i>, 1978, Vol. 21, No. 8, 666-677. This
paper has many exercises for you to do.</li>
<li>Andrews, Chapter 8 on Synchronous Message Passing, and also Section
10.2 on Occam.</li>
<li>U of Kent, Communicating Sequential Processes for Java (JCSP),
<a href="http://www.cs.kent.ac.uk/projects/ofa/jcsp/">http://www.cs.kent.ac.uk/projects/ofa/jcsp/</a></li>

<li><a href="http://www.cs.ox.ac.uk/ucs/">http://www.cs.ox.ac.uk/ucs/</a> Bill Roscoe's book Understanding
Concurrent Systems.  2010, ISBN 978-1-84882-257-3.</li>
</ol>
</div>
</div>

<div id="outline-container-org71807b7" class="outline-2">
<h2 id="org71807b7"><span class="section-number-2">10</span> End</h2>
<div class="outline-text-2" id="text-10">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2019-12-06
</div>
</body>
</html>
